app/controllers/api/schedules_controller.rb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", "78670c84-1fe9-4e10-ab16-ca32253beccb"], ["id", "c04f3403-9013-4a46-95b8-ece7f2de005a"], ["LIMIT", 1]]
---
    def update
      CRUDManagement::Update.perform(
        find_params,
        schedule_params,
        default_update_callbacks,
        Schedule.where(user_id: current_api_user.id)
      )

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", "cb61f568-6fd8-4d8c-b251-31197be4b07e"], ["id", "1306abc9-01fa-4595-9300-facf4df09fc6"], ["LIMIT", 1]]
---
    def destroy
      CRUDManagement::Destroy.perform(
        find_params,
        default_destroy_callbacks,
        Schedule.where(user_id: current_api_user.id)
      )