app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 AND "users"."id" = $2 LIMIT $3  [["id", "943d67f3-dd1e-42d9-855f-7852bd2d5e91"], ["id", "943d67f3-dd1e-42d9-855f-7852bd2d5e91"], ["LIMIT", 1]]
---
    def update
      CRUDManagement::Update.perform(
        find_params,
        update_user_params,
        default_update_callbacks,
        User.where(id: current_api_user.id)
      )