app/controllers/api/v1/meetings_controller.rb

  def create
    @meeting = Meeting.new(meeting_params)

    if @meeting.save
---
INSERT INTO "meetings" ("starts_at", "end_at", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["starts_at", "2021-12-02 10:00:00"], ["end_at", "2021-12-02 15:00:00"], ["room_id", 3], ["created_at", "2021-12-03 01:38:27.652919"], ["updated_at", "2021-12-03 01:38:27.652919"]]