app/controllers/api/v1/organizations_controller.rb

INSERT INTO "organizations" ("name", "adress", "number_of_rooms", "work_on_weekend", "business_hours_start", "business_hours_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @organization = Organization.new(organization_params)

    if @organization.save

DELETE FROM "organizations" WHERE "organizations"."id" = $1  [["id", 2]]
---
  def destroy
    @organization.destroy