app/controllers/api/v1/rooms_controller.rb

  def create
    @room = Room.new(room_params)

    if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at", "organization_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sala 1"], ["created_at", "2021-12-03 01:26:31.120083"], ["updated_at", "2021-12-03 01:26:31.120083"], ["organization_id", 1]]