app/models/meeting.rb

  def booking_conflict
    meetings_in_room = Meeting.where(room_id: room_id)
    conflicts = []
    duration = (starts_at..end_at)
    meetings_in_room.each do |meeting|
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."room_id" = $1  [["room_id", 1]]