app/models/room.rb

  def limit_reached?

    rooms_in_organization = Room.where(organization_id: organization_id)

    if rooms_in_organization.count >= self.organization.number_of_rooms
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "rooms" WHERE "rooms"."organization_id" = $1  [["organization_id", 1]]